Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: ! indicates that it will mutate or destroy the value of one or more of its arguments (compare, for example, `sort` and `sort!`).
ja: は、それが突然変異または破壊されることを示しています。 一つ以上の引数の値(例えば、`sort'、`sort!")。

source: ", ["First", "Second", "Third"]) 3-element Array{String,1}: "1.
ja: 1", ["First", "Second", "Third"]) 3-element Array{String,1}: "1.

source: "Is-Bits" :: A primitive type, or a struct type where all fields are other isbits types.
ja: 「ビット」::プリミティブ型、または構造体型であり、すべてのフィールドはその他のイスビトスタイプである。

source: "Leaf Type" :: A group of related data that includes a type-tag, is managed by the Julia GC, and is defined by object-identity.
ja: 「リーフタイプ」::タイプタグを含む関連データのグループは、Julia GCによって管理され、オブジェクト識別によって定義されます。

source: "Leaf Type" :: A group of related data that includes a type-tag, is managed by the Julia GC, and is defined by object-identity. The type parameters of a leaf type must be fully defined (no TypeVars are allowed) in order for the instance to be constructed.
ja: 「リーフタイプ」::タイプタグを含む関連データのグループは、ジュリアGCによって管理され、オブジェクト識別子によって定義されます。リーフタイプのタイプパラメータは、インスタンスが構築されるには完全に定義(TypeVarsは許可されません)されている必要があります。

source: "Primitive Type" :: A type with no fields, but a size.
ja: 「プリミティブ型」::フィールドがなくても、サイズがあるタイプです。

source: "Singleton" :: a Leaf Type or Struct with no fields.
ja: "Singleton"::a Leaf Type or Struct with no fields.(Singleton::a Leaf TypeまたはStruct with no fields.)。

source: "Struct" :: A type with all fields defined to be constant.
ja: "Struct"::A type with all fieldsが定義されています。

source: "Super Type" :: A super-type (not a leaf-type) that cannot be instantiated, but can be used to describe a group of types.
ja: 「スーパータイプ」:インスタンス化できないスーパータイプ(リーフタイプではない)ですが、タイプのグループを記述するために使用することができます。

source: "Tuple" :: an immutable data-structure similar to an anonymous struct type, or a constant array.
ja: 「タプル」:匿名構造型と似た不変のデータ構造、あるいは定数配列です。

source: "Tuple" :: an immutable data-structure similar to an anonymous struct type, or a constant array. Represented as either an array or a struct.
ja: 「タプル」:匿名構造体タイプと同様の不変データ構造、あるいは定数配列です。配列または構造体のいずれかとして表されます。

source: "Type Parameter" :: A specialization of a type (typically used for dispatch or storage optimization).
ja: 「Type Parameter」:タイプの特殊化(通常はディスパッチまたはストレージの最適化に使用されます)。

source: "TypeVar" :: The T in the type parameter declaration is referred to as a TypeVar (short for type variable).
ja: 「TypeVar」:T型パラメータ宣言のは、TypeVar(型変数の短縮形)と呼ばれます。

source: && followed by \|\| followed by ?
ja: &&のあとに、\|\|が続き、更に、?が続く

source: ("function", "library") where function is the C-exported function name.
ja: (「関数」、「ライブラリ」)関数は、Cエクスポートされた関数名です。

source: ("function", "library") where function is the C-exported function name. library refers to the shared library name: shared libraries available in the (platform-specific) load path will be resolved by name, and if necessary a direct path may be specified.
ja: (「関数」、「ライブラリ」)関数は、Cエクスポートされた関数名です。ライブラリは 共有ライブラリの名前:(プラットフォーム固有の)ロードパスで使用可能な共有ライブラリ 名前で解決する必要があり、必要に応じて直接パスを指定することができます。

source: (@id man-ambiguities)
ja: メソッドの曖昧さ (@id man-ambiguities)

source: (@id man-anonymous-functions)
ja: 無名関数 (@id man-anonymous-functions)

source: (@id man-numeric-literal-coefficients)
ja: [@id manの数値リテラル係数](@id man-numeric-literal-coefficients)

source: (@id man-strings)
ja: 文字列 (@id man-strings)

source: (@id man-vectorized)
ja: [man-vectorized](@id man-vectorized)

source: (@id non-standard-string-literals)
ja: 非標準な文字列リテラル (@id non-standard-string-literals)

source: (@ref >:) (reverse of subtype operator)
ja: (@ref>:)(サブタイプ演算子の逆)

source: (@ref man-compound-expressions): begin and (;).
ja: (@ref man-compound-expressions): 複合式: begin と(;)。

source: (@ref man-conditional-evaluation): if-elseif-else and ?: (ternary operator).
ja: (@ref man-conditional-evaluation) 条件付き評価: if-elseif-elseと ？: (三項演算子)。

source: (@ref man-dot-operators) such as .+ and .* are equivalent to broadcast calls (except that they fuse, as described below).
ja: (@ref man-dot-operators)例えば.+.*は等価です。 ブロードキャストコール(以下に説明するように融合することを除く)。

source: (@ref man-dot-operators) such as .+ and .* are equivalent to broadcast calls (except that they fuse, as described below). There is also a `broadcast!` function to specify an explicit destination (which can also be accessed in a fusing fashion by .= assignment). In fact, f.(args...)
ja: (@ref man dot演算子)例えば.+.*は等価です。 ブロードキャストコール(以下に説明するように、これらのコールが融合されることを除く)に対しては、次のように設定されます。 'ブロードキャスト!関数は明示的な宛先を指定することができます(これは .=の割り当て方法でアクセスします。実際f.(args.)

source: (@ref next) returns next character at or after the index i and the next valid character index following that.
ja: (c, j = next(str,i) はインデックスi に格納された文字とインデックス i 以降で最初の有効なインデックスを返します。

source: (@ref start) gives the first valid index at which a character can be found in str
ja: (@ref start) i=start(str) は、str にある最初の有効なインデックス(通常は1)を返します。

source: (A `transcode()` function is provided to convert to/from other Unicode encodings.)
ja: (Unicodeエンコードの変換を行うために `transcode()` 関数が 提供されていす。)

source: (Again, one should import Base.display to add new methods to display.) The return values of these functions are up to the implementation (since in some cases it may be useful to return a display "handle" of some type).
ja: (再度 import Base.displayto add new methods todisplay.これらの関数の戻り値は、次のようになります。 実装まで(ある場合には、「handle」の「handle」を返すことが役に立つことがあるので、それを実行することができます。 あるタイプ)。

source: (As we will see below, this does not necessarily mean that the last element is found at index n, where n is the length of the string.)
ja: しかし、下に示すように、文字列の長さ nのとき、文字列の最後の要素が、インデックスnが見出されるとは限りません。）

source: (By convention, we tend to space operators more tightly if they get applied before other nearby operators.
ja: （慣例的に、他の演算子が適用される場合は、スペースを開けずに記載する傾向があります。

source: (For comparison operations like <, only the elementwise .< version is applicable to arrays.)
ja: (比較のために のような操作、は、配列に適用されます。)

source: (Given r::Iterators.Reverse{T}, the underling iterator of type T is r.itr.) In our Squares example, we would implement Iterators.Reverse{Squares} methods:
ja: (r::Iterator.Reverse{T},the undering iterator of typeT)は、r.itrである。 Squaresの例では、イテレータを実装します。逆{Squares}メソッド:

source: (If the wrapper was calling a Fortran function instead, the corresponding function input signature should instead be (Ref{Csize_t},), since Fortran variables are passed by pointers.) Furthermore, n can be any type that is convertible to a Csize_t integer; the `ccall` implicitly calls `Base.cconvert(Csize_t, n)`.
ja: ( ラッパーは、代わりにFortran関数を呼び出し、対応する関数入力を呼び出しました。 Fortranの変数は次のようなものであるため、署名は(Ref{Csize_t},)でなければなりません。 ポインタによって渡される)。また、nは、変換可能な任意のタイプであることができます。 Csize_tinteger;`ccall`は暗黙的に`Base.チコンベルト(Csize_t n)`。

source: (Non-library function calls in both C and Julia can be inlined and thus may have even less overhead than calls to shared library functions.
ja: (CとJuliaの両方での非ライブラリ関数呼び出しは 共有ライブラリ関数への呼び出しよりも、インライン化されているため、オーバーヘッドが少なくて済みます。

source: (The Clang package can be used to auto-generate Julia code from a C header file.)
ja: (Clangパッケージは自動生成のために使用できます。 Cヘッダー・ファイルからのJuliaコード。)

source: (The above expression uses several features that have yet to be introduced, including for loops, Strings, and Interpolation, but should be easy enough to understand for users with some existing programming experience.)
ja: (上記の式では、(@ref man loops)など、まだ導入されていないいくつかの機能を使用しています。 (@ref man-strings)、補間は、ユーザが理解するのに十分な大きさである必要があります。 既存のプログラミング経験があります)。

source: (The above expression uses several features that have yet to be introduced, including (@ref man-loops), (@ref man-strings), and Interpolation, but should be easy enough to understand for users with some existing programming experience.)
ja: (上記の式では、(@ref man loops)など、まだ導入されていないいくつかの機能を使用しています。 (@ref man-strings)、補間は、ユーザが理解するのに十分な大きさである必要があります。 既存のプログラミング経験があります)。

source: (The above expression uses several features we have yet to introduce, including (@ref man-loops), (@ref man-strings), and Interpolation, but should be easy enough to understand for users with some existing programming experience.)
ja: （上記の式は、まだ紹介されていない for loops(@ref man-loops),、Strings(@ref man-strings)、Interpolation などの機能が含まれていますが、プログラミング経験者にとっては難しいものではないはずです。）

source: (The exceptions are operators with special evaluation semantics like && and ||.
ja: ( （例外は評価戦略が特殊な演算子で、&&や||などがあります。

source: (This allows for coexistence with other tools that might consider files called Project.toml and Manifest.toml significant.) For pure Julia projects, however, the names Project.toml and Manifest.toml are preferred.
ja: (これにより、Project.ScheduleとManifest.MenuSignificant.Menuのような他のツールとの共存が可能になります。ただし、純粋なJuliaプロジェクトでは、Project.トミルとManifest.トミルは推奨されます。トミルトミル。

source: (Using mathematicians' i or engineers' j for this global constant were rejected since they are such popular index variable names.) Since Julia allows numeric literals to be (@ref man-numeric-literal-coefficients), this binding suffices to provide convenient syntax for complex numbers, similar to the traditional mathematical notation:
ja: (このグローバル定数に対して数学者のiを使用するか、あるいはエンジニアのjを使用することは拒否されました。なぜなら、Juliaは数値リテラルが(@ref manの数値リテラル係数)であるためです。 この結合は、従来のものと同様に、複素数に対して便利な構文を提供するのに十分である。 数学的表記法:

source: (if IndexCartesian, where N = ndims(A)) N-dimensional scalar indexed assignment
ja: (もしIndexCartesianであって、N=ンダムス(A))N次元スカラーインデックス割り当て

source: (if IndexCartesian, where N = ndims(A)) N-dimensional scalar indexing
ja: (もしIndexCartesianである場合N = ndims(A))N-次元スカラーインデックス

source: (if IndexLinear) Linear scalar indexing
ja: (IndexLinear)線形スカラーのインデックス作成

source: (if IndexLinear) Scalar indexed assignment
ja: (IndexLinear)スカラーのインデックス割り当て

source: (to view the structure of this expression, try ex.head and ex.args, or use `dump`
ja: (この式の構造を表示するには、ex.headとex.argsを使用するか、`dump'を使用してください。

source: * typically denotes a noncommutative operation, where the order of the operands does matter.
ja: これに対して * はよく noncommutative非可換 演算（被演算子の順番が関係 ある 演算）を表します。does

source: -Inf is equal to itself and less then everything else except NaN.
ja: -Inf はそれ自体と等しく、 NaN を除く全てよりも小さいです。

source: . followed by ::
ja: .の後に、:: が続く

source: 1 is a literal 64-bit signed integer.
ja: 1は、リテラル64ビットの符号付き整数です。

source: 2A^2 + sin(A), using the (@ref @dot) macro) for an array A, it performs a single loop over A, computing 2a^2 + sin(a)
ja: 2a^2+sin(A)(@ref@dot<X21/>)マクロを使用して arrayAAでループを実行し、2A^2+sin(a)を計算します。

source: 3-argument conditional operator (used like: conditional ?
ja: 3引数条件付き演算子(条件付きのように使用されますか?

source: : In C++ or Java, for example, in a method call like obj.meth(arg1,arg2), the object obj "receives" the method call and is implicitly passed to the method via the this keyword, rather than as an explicit method argument.
ja: :例えば、C ++やJavaでは、obj.meth(arg1,arg2)のようなメソッドが呼ばれる時は、オブジェクトobjはメソッド呼び出しを「受け取り」、暗黙のうちにthisキーワードを介して、引数だと明示されずに、メソッドに引き渡されます。

source: : Nomenclature: while the term "constructor" generally refers to the entire function which constructs objects of a type, it is common to abuse terminology slightly and refer to specific constructor methods as "constructors".
ja: : 命名法:「コンストラクタ」という用語は、一般的には、次のような機能を構成する関数全体を指します。 タイプのオブジェクトで、用語をわずかに乱用し、特定のコンストラクタを参照することが一般的です。 「コンストラクタ」としてのメソッド。

source: : The unary operators + and - require explicit parentheses around their argument to disambiguate them from the operator ++, etc.
ja: : 単項演算子+とは、演算子++などからそれらを区別するために、引数の周りに明示的な括弧を必要とします。

source: : .. followed by \|>
ja: : .. の後に、\|>が続く

source: : iid, independently and identically distributed.
ja: iid、独立して、同一に分布している。

source: :( println("Hello, world!") )
ja: :( println("Hello, world!") ) に置き換えます。

source: :b is used in the expression construction, so the value of the variable b at that time is irrelevant -- :b is just a symbol and the variable b need not even be defined.
ja: :bは式構築で使用されるので その時の変数bは無関係である-:bは単なる記号であり、変数bは必要ない。 定義する必要があります。

source: Tasks are not so standard: they provide non-local control flow, making it possible to switch between temporarily-suspended computations.
ja: タスクはそれほど標準的ではありませんが、ローカルに限らない制御構造で、一時的に保留している計算を切り替えることができます。

source: PreviousGetting StartedNextIntegers and Floating-Point Numbers
ja: 前スタートアップ次整数および浮動小数点数</s></a>

source: Array functions
ja: 配列関数

source: Arrays with custom indices
ja: カスタムインデックスを持つ配列

source: Arrays
ja: 配列

source: Basic functions
ja: 基本関数

source: Bounds checking
ja: 境界チェック

source: Broadcast and vectorization
ja: ブロードキャストおよびベクトル化

source: C Interface
ja: Cインタフェース

source: C Standard Library
ja: C標準ライブラリ

source: Calling C and Fortran Code
ja: CとFortranのコードを呼び出す

source: Code Loading
ja: コードのロード

source: Collections and Data Structures
ja: コレクションとデータ構造

source: Combinatorics
ja: 組み合わせ

source: Complex and Rational Numbers
ja: 複素数と有理数

source: Compound Expressions
ja: 複合式Compound Expressions

source: Compound Expressions: begin and (;).
ja: 複合式: begin と(;)。

source: Concatenation and permutation
ja: 連結と置換

source: Conditional Evaluation
ja: 条件付き評価

source: Conditional Evaluation: if-elseif-else and ?: (ternary operator).
ja: 条件評価: if-elseif-else と ？: (三項演算子)。

source: Constants
ja: 定数

source: Constructors and Types
ja: コンストラクタと型

source: Constructors
ja: コンストラクタ

source: Control Flow
ja: 制御フロー

source: Conversion and Promotion
ja: 変換と昇格

source: Dates
ja: 日付

source: Delimited Files
ja: デリミタ付きファイル

source: Distributed Computing
ja: 分散コンピューティング

source: Dynamic Linker
ja: ダイナミックリンカー

source: Embedding Julia
ja: 埋め込みJulia

source: Environment Variables
ja: 環境変数

source: Eval of Julia code
ja: Juliaコードの評価

source: Exception Handling: try-catch, error() and throw().
ja: 例外処理: try-catch, error() と throw()。

source: File Events
ja: ファイル・イベント

source: Filesystem
ja: ファイルシステム

source: Functions
ja: 関数

source: Getting Started
ja: はじめよう

source: Handling Operating System Variation
ja: オペレーティング・システムの違いを扱う

source: High-level Overview of the Native-Code Generation Process
ja: ネイティブ・コード生成過程の高水準な概要()

source: I/O and Network
ja: 入出力およびネットワーク

source: Indexing and assignment
ja: インデックスと代入

source: Inference
ja: 型推論

source: Initialization of the Julia runtime
ja: Juliaランタイムの初期化

source: Integers and Floating-Point Numbers
ja: 整数および浮動小数点数

source: Interactive Utilities
ja: インタラクティブ・ユーティリティ

source: Interfaces
ja: インタフェース

source: Julia ASTs
ja: Julia AST

source: Julia Functions
ja: Julia関数

source: Linear Algebra
ja: 線形代数

source: Logging
ja: ロギング

source: Mathematical Operations and Elementary Functions
ja: 算術演算と基本関数

source: Mathematics
ja: 数学

source: Memory layout of Julia Objects
ja: Juliaオブジェクトのメモリ配置

source: Memory-mapped I/O
ja: メモリ配置入出力

source: Metaprogramming
ja: メタプログラミング

source: Methods
ja: メソッド

source: Missing Values
ja: 欠損値

source: Module loading
ja: モジュールのロード

source: Modules
ja: モジュール

source: More about types
ja: 型について詳しく

source: Multi-Threading
ja: マルチスレッド

source: Multi-dimensional Arrays
ja: 多次元配列

source: Networking and Streams
ja: ネットワーキングおよびストリーム

source: Numbers
ja: 数値

source: Parallel Computing
ja: 並列計算

source: Performance Tips
ja: 性能向上のヒント

source: Profiling
ja: プロファイリング

source: Proper maintenance and care of multi-threading locks
ja: マルチスレッド・ロックの適切な保守と管理

source: Punctuation
ja: 句読法

source: Random Numbers
ja: 乱数

source: Reflection and introspection
ja: リフレクションとイントロスペクション

source: Repeated Evaluation: Loops: while and for.
ja: 繰り返し評価: ループ: while と for。

source: Reporting and analyzing crashes (segfaults)
ja: クラッシュの報告と分析(segfaults)

source: Running External Programs
ja: 外部プログラムの実行

source: SIMD Support
ja: SIMDサポート

source: Sanitizer support
ja: サニタイザのサポート

source: Scope of Variables
ja: 変数のスコープ (可視範囲)

source: Serialization
ja: シリアル化

source: Shared Arrays
ja: 共有配列

source: Short-Circuit Evaluation: &&, || and chained comparisons.
ja: 短絡評価: &&, || と比較の連鎖。

source: Sockets
ja: ソケット

source: Sorting and Related Functions
ja: 整列と関連関数

source: Sparse Arrays
ja: 疎行列

source: Stack Traces
ja: スタック・トレース

source: StackTraces
ja: スタック・トレース

source: Static analyzer annotations for GC correctness in C code
ja: CコードにおけるGCの正確さのための静的アナライザ注釈()

source: Statistics
ja: 統計

source: Strings
ja: 文字列

source: Style Guide
ja: スタイル・ガイド

source: SubArrays
ja: 部分配列

source: System Image Building
ja: システムイメージのビルド

source: Talking to the compiler (the :meta mechanism)
ja: コンパイラとの対話(:メタメカニズム)

source: Tasks (aka Coroutines): yieldto().
ja: タスク (コルーチンの別称): yieldto()。

source: Tasks
ja: タスク

source: The Julia REPL
ja: Julia REPL

source: Types
ja: 型

source: Unicode Input
ja: Unicode入力

source: Unit Testing
ja: ユニット・テスト

source: Using Valgrind with Julia
ja: JuliaにおけるValgrindの使用</a>

source: Variables
ja: 変数

source: Working with LLVM
ja: LLVMを使用する

source: gdb debugging tips
ja: gdbデバッグのヒント

source: printf() and stdio in the Julia runtime
ja: Juliaランタイムにおけるprintf()とstdio</a></a>

source: source
ja: ソース

source: Exceptions are thrown when an unexpected condition has occurred.
ja: 例外は予想外の状況が発生したときに投げられます。

source: if blocks also return a value, which may seem unintuitive to users coming from many other languages.
ja: ifブロックは値を返しますが、他の言語を利用する多くの人の直観に反するようです。

source: if blocks are "leaky", i.e. they do not introduce a local scope.
ja: ifブロックには「漏れ」があり、ローカルスコープを採用していません。

source: count is the number of workers to spawn on the node, and defaults to 1.
ja: countはノードで作成されるワーカーの数で、デフォルトは1です。

source: user defaults to current user, port to the standard ssh port.
ja: デフォルトでは、user は現在のユーザー、 port は標準のsshポートになります。

source: -p n will launch an additional n worker processes, while --machine-file file will launch a worker for each line in file file.
ja: -p n でn個のワーカーを追加で起動することができ、 --machinefile file では file ファイルの各行ごとにワーカーが起動されます。

source: -p n will launch an additional n worker processes, while --machinefile file will launch a worker for each line in file file.
ja: -p n でn個のワーカーを追加で起動することができ、--machinefile file ではfile ファイルの各行ごとにワーカーが起動されます。

source: ARGS is also set when script code is given using the -e option on the command line (see the julia help output below).
ja: コマンドラインで -e オプションが設定された際にも ARGS は設定されます（下の julia ヘルプ出力を参照してください）。

source: <cond> <statement> end, one can write <cond> || <statement> (which could be read as: <cond> or else <statement>).
ja: <条件式> <実行文> endは、 <条件式> || <実行文>と書けます （||は、"でなければ" と読み下せます)。

source: Developer Documentation
ja: 開発者用ドキュメント

source: Developing/debugging Julia's C code
ja: JuliaのCコードを作成/デバッグする

source: Documentation of Julia's Internals
ja: Julia内部構造の記述

source: Examples:
ja: 例:

source: Manual
ja: マニュアル

source: Standard Library
ja: 標準ライブラリ

source: OurRational has a single inner constructor method which checks that both of num and den aren't zero and ensures that every rational is constructed in "lowest terms" with a non-negative denominator.
ja: OurRationalは、単一のインナー・コンストラクタ・メソッドを持っていて、それをチェックする。 numの両方とdenは0ではなく、すべての有理が「最低」で構築されることを保証します。 「負ではない分母を持つ」。

source: Recursive data structures, especially those that may be self-referential, often cannot be constructed cleanly without first being created in an incomplete state and then altered programmatically to be made whole, as a separate step from object creation.
ja: 再帰データ構造体 特に、自己参照することができるものは、しばしば、最初には、きれいに構築することはできない は不完全な状態で作成され、次にプログラムによって変更されて全体として作成されます。 オブジェクト作成とは別のステップです。

source: `CartesianIndex` and arrays of `CartesianIndex` are not compatible with the`end` keyword to represent the last index of a dimension.
ja: `CartesianIndex'と「CartesianIndex」の配列は、次元の最後のインデックスを表すために、'end"キーワードと互換性がない。

source: `CartesianIndex` and arrays of `CartesianIndex` are not compatible with the`end` keyword to represent the last index of a dimension. Do not use `end`in indexing expressions that may contain either `CartesianIndex` or arrays thereof.
ja: `CartesianIndex'と「CartesianIndex」の配列は、次元の最後のインデックスを表すために<x/><x/>'end"キーワードとは互換性がありません。"end"は、「CartesianIndex」またはその配列のいずれかを含むことができるインデックス表現では使用しないでください。

source: `Task`s are not so standard: they provide non-local control flow, making it possible to switch between temporarily-suspended computations.
ja: `タスク`s はあまり標準的ではないため、ローカルではない制御フローを提供することができます。 一時的に中断された計算です。

source: ```cint main(int argc, char **argv);```can be called via the following Julia code:```juliaargv = [ "a.out", "arg1", "arg2" ]ccall(:main, Int32, (Int32, Ptr{Ptr{UInt8}}), length(argv), argv)```
ja: `"cint主(int argc,char**argv);`"`"julia""julia"x18/>"

source: is preferred over`size(A) == size(B) || throw(DimensionMismatch("Size of A not equal to size of B"))`.However, sometimes it makes sense to keep the uppercase first letter, for instance if an argumentto a function is a capital letter: `size(A,1) == size(B,2) || throw(DimensionMismatch("A has first dimension..."))`.
ja: 'サイズ(A)==サイズ(Bの大きさに等しくないDimensionMismatch(Size of A not equal to size of B"))`ただし、引数が大文字である場合などは、大文字の文字を使用することを意味します。A,1B,2DimensionMismatch

source: : The operators +, ++ and * are non-associative.
ja: : 演算子+、++、*は、非自動調整ではありません。

source: This loop fusion is not a compiler optimization that may or may not occur, it is a syntactic guarantee
ja: ループ融合はコンパイラーの最適化ではなく、あるいは発生する可能性のあるコンパイラーの最適化ではありません。の構文保証です。

source: end, one can write || (which could be read as:
ja: end (以下のように読むことができる)を書くことができます。

source: QuickSort is the default algorithm for numeric values, including integers and floats.
ja: QuickSortは、次のような数値のデフォルト・アルゴリズムです。 整数と浮動小数点を指定します。

source: DenseArray is a very specific example of a strided array where the elements are arranged contiguously, thus it provides its subtypes with the appropriate definition of strides.
ja: <X21/>DenseArrayは エレメントが隣接して配置されたストローブ配列の非常に特異的な例であり、したがって は、の拡張の適切な定義を使用してサブタイプを提供します。

source: App has a direct dependency on your private Priv package, and an indirect dependency, through Pub, on the new public Priv package.
ja: アプリケーションは、Privパッケージに直接依存します。また、Pubを介して、新しいPrivパッケージ上の間接的な依存関係もあります。

source: `StridedVector` and `StridedMatrix` are convenient aliases for many of the builtin array types that are considered strided arrays, allowing them to dispatch to select specialized implementations that call highly tuned and optimized BLAS and LAPACK functions using just the pointer and strides.
ja: 「StridedVector」および「StridedMatrix」は、組み込み型の配列タイプの多くにとって便利なエイリアスです。 は、ストレーテッド・アレイとみなされ、選択された特殊な実装にディスパッチできるようになります。 ポインタと前進だけを使って、BLASとLAPACK関数を高度に調整し、最適化することができます。

source: Using all of a function's arguments to choose which method should be invoked, rather than just the first, is known as multiple dispatch.
ja: 関数の、最初の引数だけではなく、すべての引数を使用して、呼び出すメソッドを選択することは、多重ディスパッチとして知られています。

source: (@ref conversion-and-promotion) are defined so that operations on any combination of predefined numeric types, whether primitive or composite, behave as expected.
ja: (@ref変換とプロモーション)は定義されています。 定義済みの数値タイプの任意の組合せで、プリミティブまたはコンポジットのいずれであっても動作するようにします。 期待どおりに動作します。

source: `abs2` gives the square of the absolute value, and is of particular use for complex numbers since it avoids taking a square root.
ja: `abs2は絶対値の2乗を与え、複雑な値に対しては特に有用である。 これは平方根を取らないためです。

source: Cstring can also be used as the `ccall` return type, but in that case it obviously does not introduce any extra checks and is only meant to improve readability of the call.
ja: Cstringは、次のように使用することもできます。 `ccall'return typeであるが、この場合は明らかに余分なものは導入されない。 は、呼び出しの可読性を向上させることを目的としています。

source: library refers to the shared library name: shared libraries available in the (platform-specific) load path will be resolved by name, and if necessary a direct path may be specified.
ja: ライブラリは以下のとおりです。 共有ライブラリの名前:(プラットフォーム固有の)ロードパスで使用可能な共有ライブラリ 名前で解決する必要があり、必要に応じて直接パスを指定することができます。

source: (@ref conversion-and-promotion), however, shows how clever application of sufficiently advanced technology can be indistinguishable from magic.
ja: しかし、[Conversion and Promotion]（@ ref conversion-and-promotion）では、十分に高度な技術をうまく使うと、魔法と区別できないほどになることを示しています。[^ Clarke61]

source: X .+= Y etcetera is equivalent to X .= X .+ Y and results in a fused in-place assignment; see also (@ref man-dot-operators).
ja: X.+=YeteteraはXと同等であり、X.+YYとなり、結果は融合されたインプレース割り当てになります。 (@ref man-dot-operators)も参照してください。
